# Where to install macOS applications? Default: /Applications
cask_args appdir: "/Applications"

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'caskroom/drivers'
tap 'homebrew/bundle'
tap 'homebrew/versions'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'brew-cask-completion'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'awscli'
brew 'grep'
brew 'bats'
brew 'direnv'
brew 'git'
brew 'git-extras'
brew 'git-lfs'
brew 'hub'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'tree'
brew 'trash'
brew 'wget'
brew 'yarn'
brew 'displaylink'


# Development


# Apps
cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'cleanmymac'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'gpgtools'
cask 'hyper'
cask 'keycastr'
cask 'little-snitch'
cask 'flux'
cask 'onedrive'
cask 'quip'
cask 'sequel-pro'
cask 'micro-snitch'
cask 'textexpander'
cask 'rocket'
cask 'shuttle'
cask 'slack'
cask 'sublime-text'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
# cask 'pulsesecure'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'suspicious-package'
cask 'betterzipql'
cask 'qlimagesize'
cask 'qlprettypatch'
cask 'webpquicklook'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'

# Fonts
cask 'font-fira-mono-for-powerline'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Sketch', id: 402476602

